#amin rezaei
print("ز دست دیده و دل هر دو فریاد    ک هرچه دیده بیند دل کند یاد")
a = input("بیت بالا از کیست؟ ")
while a != "بابا طاهر"   : 
  print("اشتباهه! ")
  a = input("دوباره حدس بزنید ")
print("عالی بود ")
print("نا برده رنج گنج میسر نمیشود    مزد آن برد که جان برادر کار کرد ")
b = input("این بیت از کیست؟")
while b != "فردوسی" :
    print("اشتباهه!")
    b = input("دوباره حدس بزنید")
print("درسته!")
print("سعدیا مرد نکونام نمیرد هرگز    مرده آن است که نامش به نکویی نبرند")
c = input("بیت بالا از کیست؟‌")
while c != "سعدی" :
  print("اشتباهه!")
  c = input("دوباره حدس بزنید")
print("افرین")
